---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.SeriousElementReferenceCorruption
source: html/df078a36-94d6-2c8f-0b18-b77019e0595a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.SeriousElementReferenceCorruption Property

Element references are seriously corrupt.

## Syntax (C#)
```csharp
public static FailureDefinitionId SeriousElementReferenceCorruption { get; }
```